/**
  ********************************  STM32F4xx  *********************************
  * @文件名     ： global_define.h
  * @作者       ： strongerHuang
  * @库版本     ： V1.7.0
  * @文件版本   ： V1.0.0
  * @日期       ： 2016年07月12日
  * @摘要       ： 全局定义
  ******************************************************************************/

/* 定义防止递归包含 ----------------------------------------------------------*/
#ifndef _GLOBAL_DEFINE_H
#define _GLOBAL_DEFINE_H

/* 包含的头文件 --------------------------------------------------------------*/
#include "stm32f4xx.h"


/* 宏定义 --------------------------------------------------------------------*/
/* 标志位 */
#define FLAG_N_VALID              0xFF                     //标志无效
#define FLAG_VALID                'V'                      //标志有效


#endif /* _GLOBAL_DEFINE_H */

/**** Copyright (C)2016 strongerHuang. All Rights Reserved **** END OF FILE ****/
