/**
  ********************************  STM32F4xx  *********************************
  * @文件名     ： global_variable.c
  * @作者       ： strongerHuang
  * @库版本     ： V1.7.0
  * @文件版本   ： V1.0.0
  * @日期       ： 2016年07月12日
  * @摘要       ： 全局变量源文件
  ******************************************************************************/
/*----------------------------------------------------------------------------
  更新日志:
  2016-07-12 V1.0.0:初始版本
  ----------------------------------------------------------------------------*/
/* 包含的头文件 --------------------------------------------------------------*/
#include "global_variable.h"
#define SIZE (50)

/* 全局变量 ------------------------------------------------------------------*/
/* TIM定时器 */
volatile uint32_t Freq_InputCapture = 0;                   //输入脉冲频率
volatile uint32_t DutyCycle_InputCapture = 0;              //输入脉冲占空比
volatile uint32_t Rise = 0;                                // 上升时间

/* ADC数据 */
uint16_t data[SIZE];
uint32_t Max;

/**** Copyright (C)2016 strongerHuang. All Rights Reserved **** END OF FILE ****/
